tutorials/incompressible/pimpleFoam/LES/surfaceMountedCube/fullCase/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

channelCase=../initChannel
channelDataDir=$channelCase/postProcessing/surfaces/inlet

[ -d $channelDataDir ] || {
    echo "Unable to locate precursor channel case - exiting"
    exit 1
}

# Copy the channel data
# Note: this is mapped using a timeVaryingMapped condition on the inlet patch
mkdir -p constant/boundaryData/inlet/0
channelTimeDir=$(foamListTimes -case $channelCase -latestTime)

\cp -rf $channelDataDir/points constant/boundaryData/inlet
\cp -rf $channelDataDir/$channelTimeDir/turbulenceProperties:R constant/boundaryData/inlet/0/R
\cp -rf $channelDataDir/$channelTimeDir/turbulenceProperties:L constant/boundaryData/inlet/0/L
\cp -rf $channelDataDir/$channelTimeDir/turbulenceProperties:nuTilda constant/boundaryData/inlet/0/nuTilda
\cp -rf $channelDataDir/$channelTimeDir/U constant/boundaryData/inlet/0/U

runApplication blockMesh
runApplication decomposePar
runParallel $(getApplication)

